#include <iostream>
#include <string>
using namespace std;

int main() {
	
	/*
	Завдання 1. Напишіть програму, яка обчислює суму цілих
	чисел від а до 500 (значення a вводиться з клавіатури).*/

	/*int a; int sum = 0;
	cout << "Enter a number: "; cin >> a;
	for (int i = a; i <= 500; i++)
	{
		sum = sum + i;
	}
	cout << "Sum (" << a << " - 500): " << sum << endl;*/

	// ----------------------------------------------------

	/*Завдання 2. Напишіть програму, яка запитує два цілих
	числа x і y, після чого обчислює і виводить значення x у
	степені y*/

	/*int a = 0; int b = 0;
	cout << "Enter a: "; cin >> a;
	cout << "Enter b: "; cin >> b;
	int result = 0;
	int temp = a;
	for (int i = 1; i < b; i++)
	{
		result = a * temp;
		a = result;
		cout << result << endl;
	}
	cout << temp << "^" << b << " = " << a << endl;*/

	// ----------------------------------------------------

	/*
	Завдання 3. Знайти середнє арифметичне всіх цілих чисел
	від 1 до 1000.*/

	/*int temp = 0;

	for (int i = 0; i < 1001; i++)
	{
		temp = temp + i;
	}
	int result = 0;
	result = temp / 1000;
	cout << result;*/

	// ----------------------------------------------------

	/*
	Завдання 4. Знайти здобуток усіх цілих чисел від a до 20
	(значення a вводиться з клавіатури: 1 <= a <= 20).*/

	// int number = 0;
	// int sum = 1;

	// cout << "Enter a number: ";
	// cin >> number;

	// for (int i = number; i < (20 - number) + 1; i++)
	// {
	// 	sum = sum * number;
	// }
	// cout << "Multiply all numbers (" << number << " - " << 20 << ") = " << sum << endl;

	// ---------------------------------------------------------------------------------------

	/*Завдання 5. Написати програму, яка виводить на екран
	таблицю множення на k, де k — номер варіанта. Наприклад, для 7-го варіанта:
	7 x 2 = 14;
	7 x 3 = 21.*/

	// int variant = 0;
	// cout << "Enter your variant: ";
	// cin >> variant;

	// for (int i = 1; i < 11; i++)
	// {
	// 	int result = 0;
	// 	result = variant * i;
	// 	cout << variant << " * " << i << " = " << result << endl;
	// }
	
	/*Завдання 1. Підрахувати кількість цілих чисел у діапазоні
	від 100 до 999, які мають дві однакові цифри.*/

	// int counter = 0;

	// for (int i = 100; i <= 999; i++)
	// {
	// 		string i_str = to_string(i);
	// 		if(i_str[0] == i_str[1] || i_str[0] == i_str[2] || i_str[1] == i_str[2])
	// 		{
	// 			counter++;
	// 		}
	// }
	// cout << "Result: " << counter << endl;

	// --------------------------------------------

	/*Завдання 2. Підрахувати кількість цілих чисел у діапазоні
	від 100 до 999, у яких усі цифри різні.*/

	// int counter = 0;

	// for (int i = 100; i <= 999; i++)
	// {
	// 	string i_str = to_string(i);
	// 	if(i_str[0] != i_str[1] && i_str[0] != i_str[2] && i_str[1] != i_str[2])
	// 	{
	// 		counter++;
	// 	}
	// }
	// cout << "Result: " << counter << endl;

	// --------------------------------------------

	/*Завдання 3. Користувач вводить будь-яке ціле число.
	Необхідно з цього цілого числа видалити всі цифри 3 і 6
	і вивести назад на екран.*/

	// int number = 0;

	// cout << "Enter a number: ";
	// cin >> number;

	// string str_n = to_string(number);
	// cout << str_n.length() << endl;
	// for (int i = 0; i < str_n.length(); i++)
	// {
	// 	if(str_n[i] != '3' && str_n[i] != '6' ){
	// 		cout << str_n[i];
	// 	}
	// }
	// cout << endl;

	// -----------------------------------------------------

	/*Завдання 4. Користувач вводить будь-яке ціле число А.
	Необхідно вивести всі цілі числа В, для яких А ділиться
	без залишку на В*В і не ділиться без залишку на В*В*В.*/

	// int a = 0;
	// cout << "Enter a number: ";
	// cin >> a;

	// for (int b = 1; b < 9999; b++)
	// {
	// 	if(a % (b*b) == 0 && a % (b*b*b) != 0)
	// 	{
	// 		cout << b << ", ";
	// 	}
	// }
	// cout << endl;
	
	// ----------------------------------------------------

	/*Завдання 6. Користувач вводить ціле число. Необхідно
	вивести всі цілі числа, на які задане число ділиться без
	залишку.*/

	// int a = 0;
	// cout << "Enter a number: ";
	// cin >> a;

	// for (int i = 1; i < 9999; i++)
	// {
	// 	if(a % i == 0)
	// 	{
	// 		cout << i << ", ";
	// 	}
	// }
	// cout << endl;

	// --------------------------------

	/*Завдання 7. Користувач вводить два цілих числа.
	 Необхідно вивести всі цілі числа, на які обидва введені числа
	діляться без залишку. */

	int a = 0; int b = 0;
	cout << "Enter two numbers: " << endl;
	cin >> a >> b;

	for (int i = 1; i < 9999; i++)
	{
		if(a % i == 0 && b % i == 0)
		{
			cout << i << ", ";
		}
	}
	cout << endl;





	return 0;
}