#include <iostream>

using namespace std;

int main() {
	
	/*
	Завдання 1. Напишіть програму, яка обчислює суму цілих
	чисел від а до 500 (значення a вводиться з клавіатури).*/

	/*int a; int sum = 0;
	cout << "Enter a number: "; cin >> a;
	for (int i = a; i <= 500; i++)
	{
		sum = sum + i;
	}
	cout << "Sum (" << a << " - 500): " << sum << endl;*/

	// ----------------------------------------------------

	/*Завдання 2. Напишіть програму, яка запитує два цілих
	числа x і y, після чого обчислює і виводить значення x у
	степені y*/

	/*int a = 0; int b = 0;
	cout << "Enter a: "; cin >> a;
	cout << "Enter b: "; cin >> b;
	int result = 0;
	int temp = a;
	for (int i = 1; i < b; i++)
	{
		result = a * temp;
		a = result;
		cout << result << endl;
	}
	cout << temp << "^" << b << " = " << a << endl;*/

	// ----------------------------------------------------

	/*
	Завдання 3. Знайти середнє арифметичне всіх цілих чисел
	від 1 до 1000.*/

	/*int temp = 0;

	for (int i = 0; i < 1001; i++)
	{
		temp = temp + i;
	}
	int result = 0;
	result = temp / 1000;
	cout << result;*/

	// ----------------------------------------------------

	/*
	Завдання 4. Знайти здобуток усіх цілих чисел від a до 20
	(значення a вводиться з клавіатури: 1 <= a <= 20).*/




	return 0;
}